//=====================================================================
//文件名称：isr.c（中断处理程序源文件）
//框架提供：苏大arm技术中心(sumcu.suda.edu.cn)
//版本更新：2017.01：1.0；2019.02：A.12
//功能描述：提供中断处理程序编程框架
//=====================================================================
#include "includes.h"

//======================================================================
//程序名称：GPIOA组输入引脚中断处理程序
//触发条件：GPIOA引脚开关量输入变化触发，至于是何种变化触发，由初始化确定
//备    注：进入后，可使用gpio_get_int函数判断哪个引脚触发的中断
//         （1-引脚有GPIO中断，0-引脚无GPIO中断）
//======================================================================
void GPIOA_Handler(void)
{
	DISABLE_INTERRUPTS;     //关总中断
	//------------------------------------------------------------------
	//（在此处增加功能）

	//------------------------------------------------------------------
	ENABLE_INTERRUPTS;     //关总中断
}

//======================================================================
//程序名称：GPIOB组输入引脚中断处理程序
//触发条件：GPIOB引脚开关量输入变化触发，至于是何种变化触发，由初始化确定
//备    注：进入后，可使用gpio_get_int函数判断哪个引脚触发的中断
//         （1-引脚有GPIO中断，0-引脚无GPIO中断）
//======================================================================
void GPIOB_Handler(void)
{
	DISABLE_INTERRUPTS;     //关总中断
	//------------------------------------------------------------------
	//（在此处增加功能）

	//------------------------------------------------------------------
	ENABLE_INTERRUPTS;     //关总中断
}

//======================================================================
//程序名称：UARTA空闲中断处理程序
//触发条件：UARTA接收到结束符并且没有信号传入。
//备    注：进入本程序后，可使用uart_get_re_int函数可再进行中断标志判断
//          （1-有UART接收中断，0-没有UART接收中断）
//======================================================================
void UARTA_Handler(void)
{
	uint_8 ch;
	uint_8 flag;
	DISABLE_INTERRUPTS;      //关总中断
	//------------------------------------------------------------------
	Delay_ms(10);
	dma_read(DMA_CH0,(uint_32)gDmaRecBuf,10);//请求DMA进行传输数据
	gDmaRecFlag=1;//标志位置位
	uart_IdleIrq_clear(UARTA);//请中断标志位
	//------------------------------------------------------------------
	ENABLE_INTERRUPTS;       //开总中断
}


//======================================================================
//程序名称：SPIA接收中断处理程序
//触发条件：SPIA收到数据触发
//======================================================================
void SPIA_Handler(void)
{
	DISABLE_INTERRUPTS;     //关总中断
	//------------------------------------------------------------------
	//（在此处增加功能）

	//------------------------------------------------------------------
	ENABLE_INTERRUPTS;     //关总中断
}

//======================================================================
//程序名称：SPIA接收中断处理程序
//触发条件：SPIA收到数据触发
//======================================================================
void SPIB_Handler(void)
{
	DISABLE_INTERRUPTS;     //关总中断
	//------------------------------------------------------------------
	//（在此处增加功能）

	//------------------------------------------------------------------
	ENABLE_INTERRUPTS;     //关总中断
}

//======================================================================
//程序名称：I2CA接收中断处理程序
//触发条件：I2CA收到数据触发
//======================================================================
void I2CA_Handler(void)
{
	DISABLE_INTERRUPTS;     //关总中断
	//------------------------------------------------------------------
	//（在此处增加功能）

	//------------------------------------------------------------------
	ENABLE_INTERRUPTS;     //关总中断
}


//======================================================================
//程序名称：I2C1接收中断处理程序
//触发条件：I2CB收到数据触发
//======================================================================
void I2CB_Handler(void)
{
	DISABLE_INTERRUPTS;     //关总中断
	//------------------------------------------------------------------
	//（在此处增加功能）

	//------------------------------------------------------------------
	ENABLE_INTERRUPTS;     //关总中断
}


//======================================================================
//程序名称：TIMERA_Handler（TIMERA模块中断处理程序）
//触发条件：定时器计时达到初始化时设置的计时间隔时，触发定时器溢出中断
//======================================================================
void TIMERA_Handler(void)
{
	DISABLE_INTERRUPTS;                       //关总中断
	//------------------------------------------------------------------

	//------------------------------------------------------------------
    ENABLE_INTERRUPTS;                        //开总中断
}

//======================================================================
//程序名称：TIMERB_Handler（TIMERB模块中断处理程序）
//触发条件：定时器计时达到初始化时设置的计时间隔时，触发定时器溢出中断
//======================================================================
void TIMERB_Handler(void)
{
	DISABLE_INTERRUPTS;                        //关总中断
	//------------------------------------------------------------------
	//（在此处增加功能）

	//------------------------------------------------------------------
	ENABLE_INTERRUPTS;                        //开总中断
}

//======================================================================
//程序名称：TSI中断处理程序
//触发条件：TSI通道超值中断，可设置其触发阈值的上下限，当TSI通道计数器超出
//         阈值范围时触发此中断
//======================================================================
void TSI_Handler(void)
{
	DISABLE_INTERRUPTS;                        //关总中断
	//------------------------------------------------------------------
	//（在此处增加功能）

	//------------------------------------------------------------------
	ENABLE_INTERRUPTS;                        //开总中断
}

//======================================================================
//程序名称：输入捕捉中断处理程序
//触发条件：输入捕捉引脚捕捉到初始化时设定的电平变化信号时触发
//======================================================================
void INCAP_Handler(void)
{
	DISABLE_INTERRUPTS;     //关总中断
	//------------------------------------------------------------------
	//（在此处增加功能）

	//------------------------------------------------------------------
	ENABLE_INTERRUPTS;     //关总中断
}

//======================================================================
//程序名称：DMA1完成接收中断处理程序
//触发条件：DMA1接收到一个字节的数据
//功能：
//======================================================================
void DMA1_IRQHandler(void)
{
	uint_32 ch;
	uint_8 flag;
	DISABLE_INTERRUPTS;     //关总中断
	//------------------------------------------------------------------
	//（在此处增加功能）
//	switch(DMA_CH0)
//	{
//		case UARTA:UART0_C2&=~ UART_C2_RIE_MASK;//禁用UART0接收中断
//			break;
//		case UARTB:UART1_C2&=~ UART_C2_RIE_MASK;//禁用UART1接收中断
//			break;
//		case UARTC:UART2_C2&=~ UART_C2_RIE_MASK;//禁用UART2接收中断
//			break;
//		default:break;
//	}
	//接收一个字节
	//------------------------------------------------------------------
	DMA_DCR(1)|=DMA_DCR_EINT_MASK;
	//------------------------------------------------------------------
	ENABLE_INTERRUPTS;     //关总中断
}


/*
 知识要素：
 1.本文件中的中断处理函数调用的均是相关设备封装好的具体构件，在更换芯片
 时，只需保证设备的构件接口一致，即可保证本文件的相关中断处理函数不做任何
 更改，从而达到芯片无关性的要求。
 */
