/*
 * valueType.h
 *
 *  Created on: 2018年5月9日
 *      Author: 13341
 */
#ifndef _VALUETYPE_H
#define _VALUETYPE_H

#include "common.h"

//=====================================================================
//函数名称：IntConvertToStr
//函数返回：无
//参数说明：num：待转换为字符串的数字；str：字符串转换完成后存储的位置；
//功能概要：将指定进制的整型数转为字符串
//=====================================================================
uint_8 *IntConvertToStr(int_32 num,uint_8 *str);

//=====================================================================
//函数名称：DoubleConvertToStr
//函数返回：无
//参数说明：num：待转换为字符串的数字；n:保留小数位数；str：字符串转换完成后存储的位置；
//功能概要：将指定进制的浮点数型数转为字符串
//=====================================================================
uint_8 *DoubleConvertToStr(double num,int_32 n,uint_8 *str);

//=====================================================================
//函数名称：ArrayCopy
//函数返回：无
//参数说明：dest：复制后存放的数组；source：被复制的数组；len:复制的长度
//功能概要：从源数组复制指定长度的内容到目标数组
//=====================================================================
void ArrayCopy(uint_8 * dest,uint_8*source,uint_16 len);
#endif
